---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheetType.MajorEndOverhang
source: html/c4722125-f837-463b-fc16-e9e0ac29071c.htm
---
# Autodesk.Revit.DB.Structure.FabricSheetType.MajorEndOverhang Property

The distance from the edge of the sheet to the last wire (measured in the major direction).

## Syntax (C#)
```csharp
public double MajorEndOverhang { get; }
```